Revit 2026 API

# DuctFittingAndAccessoryPressureDropData Class

---

The input and output data used by external servers for calculation of the duct fitting and duct accessory pressure drop.

SystemObject Autodesk.Revit.DB.MechanicalDuctFittingAndAccessoryPressureDropData

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DuctFittingAndAccessoryPressureDropData : IDisposable
```
```vb
Public Class DuctFittingAndAccessoryPressureDropData
	Implements IDisposable
```
```cpp
public ref class DuctFittingAndAccessoryPressureDropData : IDisposable
```
```fsharp
type DuctFittingAndAccessoryPressureDropData =
    class
        interface IDisposable
    end
```

The DuctFittingAndAccessoryPressureDropData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CalculationType | The calculation type, a bitmask of FittingAndAccessoryCalculationType. |
|  | IsCurrentEntityValid | True if the current settings stored in the entity is valid. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DuctFittingAndAccessoryPressureDropData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDuctFittingAndAccessoryData | Returns the fitting and accessory information. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetPresureDropItems | Returns the pressure drop items. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetDefaultEntity | Stores the default entity in the data. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace